
{
  "name": "Cross-site scripting",
  "labs": [
   
    {
        "labScenario": "Reflected XSS into HTML context with nothing encoded",
        "labDescription": "This lab contains a simple reflected cross-site scripting vulnerability in the search functionality.\nTo solve the lab, perform a cross-site scripting attack that calls the alert function.",
        "vulnerabilityName": "Cross-site scripting",
        "labLevel": "easy"
    },
    {
        "labScenario": "Stored XSS into HTML context with nothing encoded",
        "labDescription": "This lab contains a stored cross-site scripting vulnerability in the comment functionality.\nTo solve the lab, submit a comment that calls the alert function when the blog post is viewed.",
        "vulnerabilityName": "Cross-site scripting",
        "labLevel": "easy"
    },
    {
        "labScenario": "DOM XSS in document.write sink using source location.search",
        "labDescription": "This lab contains a DOM-based cross-site scripting vulnerability in the search query tracking functionality. It uses the JavaScript document.write function, which writes data out to the page. The document.write function is called with data from location.search, which you can control using the website URL.\nTo solve this lab, perform a cross-site scripting attack that calls the alert function.",
        "vulnerabilityName": "Cross-site scripting",
        "labLevel": "medium"
    },
    {
        "labScenario": "DOM XSS in innerHTML sink using source location.search",
        "labDescription": "This lab contains a DOM-based cross-site scripting vulnerability in the search blog functionality. It uses an innerHTML assignment, which changes the HTML contents of a div element, using data from location.search.\nTo solve this lab, perform a cross-site scripting attack that calls the alert function.",
        "vulnerabilityName": "Cross-site scripting",
        "labLevel": "medium"
    },
    {
        "labScenario": "DOM XSS in jQuery anchor href attribute sink using location.search source",
        "labDescription": "This lab contains a DOM-based cross-site scripting vulnerability in the submit feedback page. It uses the jQuery library's $ selector function to find an anchor element, and changes its href attribute using data from location.search.\nTo solve this lab, make the \"back\" link alert document.cookie.",
        "vulnerabilityName": "Cross-site scripting",
        "labLevel": "medium"
    }

   ]
}